In [1]:
import pandas as pd

In [40]:
train=pd.read_csv('train1.csv')
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [41]:
train.drop(['Name','Parch','Ticket','Cabin'],axis='columns',inplace=True)
train.head()

   PassengerId  Survived  Pclass     Sex   Age  SibSp     Fare Embarked
0            1         0       3    male  22.0      1   7.2500        S
1            2         1       1  female  38.0      1  71.2833        C
2            3         1       3  female  26.0      0   7.9250        S
3            4         1       1  female  35.0      1  53.1000        S
4            5         0       3    male  35.0      0   8.0500        S

In [42]:
inputs=train.drop('Survived',axis='columns')
target=train.Survived

In [43]:
inputs.Sex=inputs.Sex.map({'male':1,'female':2})

In [44]:
inputs.Embarked=inputs.Embarked.map({'S':1,'C':2,'Q':3})

In [45]:
inputs.head()

   PassengerId  Pclass  Sex   Age  SibSp     Fare  Embarked
0            1       3    1  22.0      1   7.2500       1.0
1            2       1    2  38.0      1  71.2833       2.0
2            3       3    2  26.0      0   7.9250       1.0
3            4       1    2  35.0      1  53.1000       1.0
4            5       3    1  35.0      0   8.0500       1.0

In [46]:
inputs.columns[inputs.isna().any()]

Index(['Age', 'Embarked'], dtype='object')

In [47]:
inputs.Age=inputs.Age.fillna(inputs.Age.mean())
inputs.Embarked=inputs.Embarked.fillna(inputs.Embarked.mean())
inputs.head()

   PassengerId  Pclass  Sex   Age  SibSp     Fare  Embarked
0            1       3    1  22.0      1   7.2500       1.0
1            2       1    2  38.0      1  71.2833       2.0
2            3       3    2  26.0      0   7.9250       1.0
3            4       1    2  35.0      1  53.1000       1.0
4            5       3    1  35.0      0   8.0500       1.0

In [48]:
test=pd.read_csv('test1.csv')
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [49]:
pid=test.PassengerId
test.drop(['Name','Parch','Ticket','Cabin'],axis='columns',inplace=True)
test.head()

   PassengerId  Pclass     Sex   Age  SibSp     Fare Embarked
0          892       3    male  34.5      0   7.8292        Q
1          893       3  female  47.0      1   7.0000        S
2          894       2    male  62.0      0   9.6875        Q
3          895       3    male  27.0      0   8.6625        S
4          896       3  female  22.0      1  12.2875        S

In [50]:
test.Sex=test.Sex.map({'male':1,'female':2})

In [51]:
test.Embarked=test.Embarked.map({'S':1,'C':2,'Q':3})

In [52]:
test.head()

   PassengerId  Pclass  Sex   Age  SibSp     Fare  Embarked
0          892       3    1  34.5      0   7.8292         3
1          893       3    2  47.0      1   7.0000         1
2          894       2    1  62.0      0   9.6875         3
3          895       3    1  27.0      0   8.6625         1
4          896       3    2  22.0      1  12.2875         1

In [53]:
test.columns[test.isna().any()]

Index(['Age', 'Fare'], dtype='object')

In [54]:
test.Age=test.Age.fillna(test.Age.mean())
test.Age=round(test.Age,0)
test

     PassengerId  Pclass  Sex   Age  SibSp      Fare  Embarked
0            892       3    1  34.0      0    7.8292         3
1            893       3    2  47.0      1    7.0000         1
2            894       2    1  62.0      0    9.6875         3
3            895       3    1  27.0      0    8.6625         1
4            896       3    2  22.0      1   12.2875         1
..           ...     ...  ...   ...    ...       ...       ...
413         1305       3    1  30.0      0    8.0500         1
414         1306       1    2  39.0      0  108.9000         2
415         1307       3    1  38.0      0    7.2500         1
416         1308       3    1  30.0      0    8.0500         1
417         1309       3    1  30.0      1   22.3583         2

[418 rows x 7 columns]

In [55]:
test.Fare=test.Fare.fillna(test.Fare.mean())
test.head()

   PassengerId  Pclass  Sex   Age  SibSp     Fare  Embarked
0          892       3    1  34.0      0   7.8292         3
1          893       3    2  47.0      1   7.0000         1
2          894       2    1  62.0      0   9.6875         3
3          895       3    1  27.0      0   8.6625         1
4          896       3    2  22.0      1  12.2875         1

In [56]:
from sklearn import svm
from sklearn.ensemble import RandomForestClassifier
from sklearn.linear_model import LogisticRegression
from sklearn.naive_bayes import GaussianNB
from sklearn.naive_bayes import MultinomialNB
from sklearn.tree import DecisionTreeClassifier

In [57]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test=train_test_split(inputs,target,test_size=0.3)

In [58]:
from sklearn.model_selection import cross_val_score

In [59]:
cross_val_score(svm.SVC(kernel='linear',C=200,gamma='auto'),inputs,target,cv=5)

array([0.76536313, 0.76966292, 0.81460674, 0.7752809 , 0.82022472])

In [60]:
cross_val_score(RandomForestClassifier(n_estimators=100),inputs,target,cv=5)

array([0.70391061, 0.78651685, 0.85393258, 0.82022472, 0.84269663])

In [61]:
cross_val_score(LogisticRegression(solver='liblinear',multi_class='auto',C=500),inputs,target,cv=5)

array([0.7877095 , 0.78089888, 0.78651685, 0.78089888, 0.80337079])

In [62]:
cross_val_score(GaussianNB(),inputs,target,cv=5)

array([0.78212291, 0.78651685, 0.79775281, 0.78651685, 0.80337079])

In [63]:
cross_val_score(MultinomialNB(),inputs,target,cv=5)

array([0.51955307, 0.64044944, 0.66292135, 0.73595506, 0.69101124])

In [64]:
cross_val_score(DecisionTreeClassifier(criterion='gini'),inputs,target,cv=5)

array([0.59776536, 0.75842697, 0.80337079, 0.78089888, 0.84269663])

In [65]:
model=RandomForestClassifier(n_estimators=100)

In [66]:
model.fit(X_train,y_train)

RandomForestClassifier(bootstrap=True, ccp_alpha=0.0, class_weight=None,
                       criterion='gini', max_depth=None, max_features='auto',
                       max_leaf_nodes=None, max_samples=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, n_estimators=100,
                       n_jobs=None, oob_score=False, random_state=None,
                       verbose=0, warm_start=False)

In [67]:
model.score(X_test,y_test)

0.8283582089552238

In [68]:
model.predict(X_test)

array([0, 0, 1, 1, 0, 1, 1, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0,
       0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 1,
       0, 1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 0, 1,
       0, 0, 1, 1, 0, 0, 1, 0, 0, 0, 1, 1, 1, 0, 1, 0, 1, 1, 1, 0, 1, 0,
       0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0,
       0, 0, 0, 0, 0, 1, 0, 1, 1, 0, 0, 1, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0,
       0, 1, 1, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 1,
       0, 1, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1,
       1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1,
       0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 1, 0, 1, 1, 1, 1, 0, 0, 0, 1, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 1, 0, 0, 0, 1, 1, 0, 1,
       1, 1, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 0,
       0, 1, 1, 1], dtype=int64)

In [69]:
y_predict=model.predict(test)
y_predict

array([0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 1, 0,
       1, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1,
       1, 0, 1, 0, 1, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 1,
       1, 0, 1, 1, 0, 0, 0, 1, 1, 1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0,
       0, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0,
       0, 0, 1, 0, 1, 0, 0, 1, 1, 1, 1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 1,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0,
       0, 0, 1, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1,
       1, 1, 1, 1, 0, 1, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0,
       0, 0, 1, 1, 0, 1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0,
       1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 1, 1, 1, 1,
       0, 0, 0, 1, 1, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1,
       0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0,
       0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1,
       0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0,
       1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 1, 0,
       0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 1, 0, 0, 1, 0, 0,
       1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 1, 0, 0, 0, 1,
       0, 1, 0, 0, 1, 0, 1, 1, 1, 0, 0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 0, 0],
      dtype=int64)

In [70]:
sub=pd.DataFrame()

In [71]:
sub['PassengerId']=pid
sub['Survived']=y_predict

In [73]:
sub

     PassengerId  Survived
0            892         0
1            893         0
2            894         0
3            895         0
4            896         0
..           ...       ...
413         1305         0
414         1306         1
415         1307         0
416         1308         0
417         1309         0

[418 rows x 2 columns]

In [74]:
sub.to_csv('submission3.csv',index=False)

In [75]:
sub

     PassengerId  Survived
0            892         0
1            893         0
2            894         0
3            895         0
4            896         0
..           ...       ...
413         1305         0
414         1306         1
415         1307         0
416         1308         0
417         1309         0

[418 rows x 2 columns]